*** Getting somewhere
How to get Babel to work with AppleScript:
[[food][bar]]
[[https://github.com/stig/ob-applescript.el][stig/ob-applescript.el: AppleScript integration for Org Babel]]

Or just hack it:
#+BEGIN_SRC sh
osascript <<'END'
display dialog "Hello, World"
END
#+END_SRC

#+RESULTS:
: button returned:OK


Next track.
#+BEGIN_SRC sh
osascript <<'END'
  tell application "iTunes"
    next track
  end tell
END
#+END_SRC


Play and pause.
#+BEGIN_SRC shell
osascript -e "Tell application \"iTunes\" to play"
osascript -e "Tell application \"iTunes\" to pause"
#+END_SRC


Plays all but not in order
#+BEGIN_SRC sh
osascript <<'END'
  tell application "iTunes"
    set oldfi to fixed indexing
    set fixed indexing to true
    play (every track of playlist "Library" whose album is "Mozart: Violin Sonatas")
    set fixed indexing to oldfi
  end tell
END
#+END_SRC


Dump track numbers does show 1..9 i.e. in order.
#+BEGIN_SRC sh
tell application "iTunes"
  set oldfi to fixed indexing
  set fixed indexing to true
  set demTracks to (every track of playlist "Library" whose album is "Mozart: Violin Sonatas")
  set strTrackNumber to ""
  repeat with aTrack in demTracks
    set strTrackNumber to strTrackNumber & " " & track number of aTrack
  end repeat
  display dialog "track numbers: " & track number of aTrack
  set fixed indexing to oldfi
end tell
#+END_SRC


Works but cannot delete while play else will not play
#+BEGIN_SRC sh
osascript <<'END'
  set album_name to "Mozart: Violin Sonatas"

  set tNums to ""
  tell application "iTunes"
  	set tmpPL to (make new playlist with properties {name:"Album: " & album_name})
  	set demTracks to (every track of playlist "Library" whose album is album_name)
  	repeat with aTrack in demTracks
  		duplicate aTrack to tmpPL
  		set tNums to tNums & " " & track number of aTrack
  	end repeat
  	play tmpPL
  	-- delete tmpPL
  end tell
  -- display dialog "track numbers: " & tNums
END
#+END_SRC


Works without making a playlist
#+BEGIN_SRC sh
  osascript <<'END'
    set album_name to "Mozart: Violin Sonatas"

    tell application "iTunes"
        set tracks to {}
    	set demTracks to (every track of playlist "Library" whose album is album_name)
      	repeat with aTrack in demTracks
            copy aTrack to the end of the tracks
    	end repeat
    	play tracks
    end tell
  END
#+END_SRC


